const question = [
    {
        quizTitle: "빈 칸에 들어갈 내용은?",
        quizContent: "( ______ ) 는 개발하고자 하는 소프트웨어의 사전 작업을 통하여 소프트웨어 개발을 쉽게 하도록 기본 틀을 만드는 것으로, 복잡한 개발을 체계적으로 접근하기 위 한 밑그림이라 할 수 있다. 학술적인 정의로는 권도형(2004)에 따르면 소프트웨어를 구 성하는 컴포넌트들의 상호 작용 및 관계, 각각의 특성을 기반으로 컴포넌트들이 상호 유기적으로 결합하는 소프트웨어의 진화를 위한 여러 가지 원칙들의 집합이라고 할 수 있다.",
        quizAnswer: "고양이",
    },
    {
        quizTitle: "소프트웨어 아키텍처의 활용에 대한 내용 중 틀린 것은? ",
        quizContent: "1. 비교적 간단한 소프트웨어를 개발할 때에는 완성해야 하는 목적과 기능을 중점으로 설계하여도 품질에는 큰 문제가 없다 <br><br>"
        +  "2. 소프트웨어의 기능이 복잡, 다양해짐에 따라, 그 기능을 목적에 알맞게 정의하여 분류하여야 하는 명제를 안게 되었다.<br><br>" 
        +  "3. 분류된 기능이 세분화되면 상호 간에 유기적으로 통합하는 과정이 매우 쉬워진다.<br><br>" 
        +  "4. 완전한 소프트웨어를 개발하기 위하여 각각의 기능적 특성을 사전에 파악하여 요구 분석 단계부터 설계 단계까지 분류된 기능과 함께 종합적인 시각으로 판단하는 것이 매우 필요해진다.<br>",
        quizAnswer: "4",
    },
    {
        quizTitle: "문제 3번",
        quizContent: "문제 3번 내용",
        quizAnswer: "2",
    }
]